TunableBottleneckClassifier(
  (net): Sequential(
    (0): Linear(in_features=128, out_features=8, bias=True)
    (1): Tanh()
    (2): Linear(in_features=8, out_features=16, bias=True)
  )
)

Total parameters: 1176
Trainable parameters: 1176
