TunableBottleneckClassifier(
  (net): Sequential(
    (0): Linear(in_features=128, out_features=32, bias=True)
    (1): Tanh()
    (2): Linear(in_features=32, out_features=16, bias=True)
  )
)

Total parameters: 4656
Trainable parameters: 4656
