CNN2D(
  (features): Sequential(
    (0): Conv2d(30, 32, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (1): ReLU(inplace=True)
    (2): Conv2d(32, 64, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1))
    (3): ReLU(inplace=True)
    (4): AdaptiveAvgPool2d(output_size=1)
  )
  (classifier): Linear(in_features=64, out_features=9, bias=True)
)

Total parameters: 27753
Trainable parameters: 27753
