CNN3D(
  (features): Sequential(
    (0): Conv3d(1, 8, kernel_size=(5, 3, 3), stride=(1, 1, 1), padding=(2, 1, 1))
    (1): ReLU(inplace=True)
    (2): Conv3d(8, 16, kernel_size=(3, 3, 3), stride=(1, 1, 1), padding=(1, 1, 1))
    (3): ReLU(inplace=True)
    (4): AdaptiveAvgPool3d(output_size=1)
  )
  (classifier): Linear(in_features=16, out_features=9, bias=True)
)

Total parameters: 3993
Trainable parameters: 3993
