BottleneckClassifier(
  (net): Sequential(
    (0): Linear(in_features=128, out_features=6, bias=True)
    (1): Tanh()
    (2): Linear(in_features=6, out_features=9, bias=True)
  )
)

Total parameters: 837
Trainable parameters: 837
