Sequential(
  (0): LayerNorm((128,), eps=1e-05, elementwise_affine=True)
  (1): Linear(in_features=128, out_features=128, bias=True)
  (2): ReLU(inplace=True)
  (3): Dropout(p=0.3, inplace=False)
  (4): Linear(in_features=128, out_features=16, bias=True)
)

Total parameters: 18832
Trainable parameters: 18832
